BlazeDemo-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: BlazeDemo-Selenium
  iterations: 10
  concurrency:
    local: 1
    cloud: 1
  locations:
    us-west-1: 1

scenarios:
  BlazeDemo-Selenium:
    browser: Chrome  # available browsers are: ["Firefox", "Chrome", "Ie", "Opera"]
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: 01_LoadURL
      actions:
      - go(http://blazedemo.com/)
      - waitByCSS(input.btn.btn-primary)
    - label: 02_Click_Find
      actions:
      - clickByCSS(input.btn.btn-primary)
      - waitByCSS(input.btn.btn-small)
    - label: 03_Choose_Flight
      actions:
      - clickByCSS(input.btn.btn-small)
      - waitByCSS(input.btn.btn-primary)
    - label: 04_Enter_Data
      actions:
      - clickByID(inputName)
      - typeByID(inputName): "Test"
      - clickByID(address)
      - typeByID(address): "123 Test St."
      - clickByID(city)
      - typeByID(city): "Testtown"
      - typeByID(state): "New York"
      - typeByID(zipCode): "12321"
      - clickByID(creditCardNumber)
      - typeByID(creditCardNumber): "123123123123"
      - clickByID(nameOnCard)
      - typeByID(nameOnCard): "Test Card"
    - label: 05_Click_Purchase
      actions:
      - clickByCSS(input.btn.btn-primary)